ERP.belugaerp/src/DataProcessors/бг_ЗагрузкаЗаказовКлиентовСПорталаТвойДом/бг_ЗагрузкаЗаказовКлиентовСПорталаТвойДом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бг_ЗагрузкаЗаказовКлиентовСПорталаТвойДом</name>
</mdclass:DataProcessor>

ERP.belugaerp/src/InformationRegisters/бг_СоглашенияИДоговорыСКлиентамиПоВидамНоменклатуры/бг_СоглашенияИДоговорыСКлиентамиПоВидамНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_СоглашенияИДоговорыСКлиентамиПоВидамНоменклатуры</name>
  <resources>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_ИсточникиЗагрузкиЗаказовКлиентов/бг_ИсточникиЗагрузкиЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ИсточникиЗагрузкиЗаказовКлиентов</name>
  <enumValues>
    <name>B2B</name>
  </enumValues>
  <enumValues>
    <name>Creatio</name>
  </enumValues>
  <enumValues>
    <name>EDI</name>
  </enumValues>
  <enumValues>
    <name>PortalDistr</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_SAP</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_SAP_СONSOLIDATED</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_HYBRIS</name>
  </enumValues>
  <enumValues>
    <name>СобственныйКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ТвойДом</name>
  </enumValues>
  <enumValues>
    <name>Чикаго</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>бг_АнализыДляУдостоверенияОКачестве</name>
    <type>
      <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вариативность</name>
    <type>
      <types>CatalogRef.бг_ВариативностьНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕК_СУМ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СУМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНоменклатурыSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонтрагентПроизводитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НормативныйДокумент</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбменB2B</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОписаниеСоставаПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновноеНаименование</name>
    <type>
      <types>CatalogRef.бг_ОсновныеНаименованияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокГодности</name>
    <type>
      <types>CatalogRef.бг_ЕК_Номенклатура_СрокГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокХраненияПробВЛабораторииМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаПроизводителя</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипИмпортныхССП</name>
    <type>
      <types>EnumRef.бг_ТипыИмпортныхССП</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипМарки</name>
    <type>
      <types>CatalogRef.бг_КлассификаторТиповМарок</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УсловияТранспортирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФайлПиктограммы</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_СпособыОбеспеченияПотребности</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбеспеченияПотребностей</name>
      <type>
        <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/НоменклатураКонтрагентов/НоменклатураКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>бг_КодНоменклатурыКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВладелецНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/DataProcessors/бг_ЗагрузкаЗаказовКлиентовСПорталаТвойДом/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы 

&НаКлиенте
Процедура ПутьККаталогуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог = ПутьККаталогу;
	ДиалогВыбораКаталога.Заголовок = НСтр("ru='Выберите каталог'");
	
	ОповещениеЗавершенияВыбора = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	
	ДиалогВыбораКаталога.Показать(ОповещениеЗавершенияВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Партнер = ?(
		ЗначениеЗаполнено(Контрагент), 
		ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер"), 
		ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиФайлыВКаталоге(Команда)

	ОчиститьСписок(Неопределено);
	
	Если ПустаяСтрока(ПутьККаталогу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указан путь к каталогу. Поиск файлов невозможен.'"));
		Возврат;
	КонецЕсли;
	
	КаталогПоиска = Новый Файл(ПутьККаталогу);
	
	Если Не КаталогПоиска.Существует() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Указан несуществующий каталог.'"));
		Возврат;	
	КонецЕсли;
	
	МаскаФайлов = "*.xml";
	
	ОповещениеОкончанияПоискаФайлов = Новый ОписаниеОповещения("НайтиФайлыВКаталогеЗавершение", ЭтотОбъект);
	
	НачатьПоискФайлов(ОповещениеОкончанияПоискаФайлов, ПутьККаталогу, МаскаФайлов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписок(Команда)
	
	НайденныеФайлыСписок.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыделенныеФайлы(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.НайденныеФайлыСписок.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбраны файлы к загрузке.'"));
		Возврат;	
	КонецЕсли;
	
	СоответствиеДанныхФайлам = ДанныеФайлов(ВыделенныеСтроки);
	СоздатьЗаказыКлиентам(СоответствиеДанныхФайлам);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоответствиеНоменклатуры(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.НайденныеФайлыСписок.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбраны файлы к проверке.'"));
		Возврат;	
	КонецЕсли;
	
	СоответствиеДанныхФайлам = ДанныеФайлов(ВыделенныеСтроки);
	
	ОшибкиПоискаНоменклатуры = ПроверитьСоответствиеНоменклатурыКонтрагентов(СоответствиеДанныхФайлам);
	
	Если ОшибкиПоискаНоменклатуры.Количество() <> 0 Тогда
		ОткрытьФормуПредставленияОшибокСозданияЗаказов(ОшибкиПоискаНоменклатуры);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Ошибок не найдено.'"));	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНайденныеФайлы

&НаКлиенте
Процедура НайденныеФайлыСписокПриАктивизацииСтроки(Элемент)
	
	СодержимоеВыбранногоФайла = Новый ТекстовыйДокумент;
	
	ВыделенныеСтроки = Элементы.НайденныеФайлыСписок.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеСодержимого = "";
	СтрокаРазделения = СтрокаРазделенияСодержимогоФайлов();
	
	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
		
		ВыделенныйФайл = НайденныеФайлыСписок.НайтиПоИдентификатору(Идентификатор);
		
		ТекстСодержимого = ТекстСодержимогоФайла(ВыделенныйФайл.Значение);
		
		ПредставлениеСодержимого = ПредставлениеСодержимого 
			+ ?(ПустаяСтрока(ПредставлениеСодержимого), "", СтрокаРазделения) 
			+ ТекстСодержимого;
		
	КонецЦикла;
	
	СодержимоеВыбранногоФайла.ВставитьСтроку(1, ПредставлениеСодержимого);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатыОбработки

&НаКлиенте
Процедура РезультатыОбработкиФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.РезультатыОбработкиФайлов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекущиеДанные.ОшибкиПриСоздании) Тогда
		
		ОшибкиСоздания = СтрРазделить(ТекущиеДанные.ОшибкиПриСоздании, Символы.ПС, Ложь);
		
		ОшибкиПоискаНоменклатуры = Новый Соответствие;
		ОшибкиПоискаНоменклатуры.Вставить(ТекущиеДанные.ПутьКФайлу, ОшибкиСоздания);
		
		ОткрытьФормуПредставленияОшибокСозданияЗаказов(ОшибкиПоискаНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СозданиеЗаказовКлиентов

 &НаСервере
Процедура СоздатьЗаказыКлиентам(ДанныеФайлов)
	
	Для Каждого ДанныеФайла Из ДанныеФайлов Цикл
		
		ДанныеДокумента = ДанныеФайла.Значение;
		
		ТаблицаТоваров = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(ДанныеДокумента.Товары);
				
		Если ТаблицаТоваров.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru='%1 был пропущен. Отсутствуют товары в файле.'"), 
				ДанныеФайла.Ключ));
			Продолжить;	
		КонецЕсли;
		
		Отбор = Новый Структура("ПутьКФайлу", ДанныеФайла.Ключ);
		
		СтрокиРезультата = РезультатыОбработкиФайлов.НайтиСтроки(Отбор);
		
		ЕстьЗапись = СтрокиРезультата.Количество() <> 0;
		СтрокаРезультата = ?(ЕстьЗапись, СтрокиРезультата[0], Неопределено);
			
		ЗаказКлиентаОбъект = ?(
			СтрокаРезультата <> Неопределено
				И ЗначениеЗаполнено(СтрокаРезультата.ЗаказКлиента), 
			СтрокаРезультата.ЗаказКлиента.ПолучитьОбъект(), 
			Документы.ЗаказКлиента.СоздатьДокумент());
			
		ЗаполнитьШапкуЗаказа(ЗаказКлиентаОбъект, ДанныеДокумента);	
		
		ОшибкиЗаполнения = Новый Массив;	
		ЗаполнитьТабличнуюЧастьЗаказа(ЗаказКлиентаОбъект, ТаблицаТоваров, ОшибкиЗаполнения); 
		
		ЗаполнитьУсловияПродажи(ЗаказКлиентаОбъект);
		
		ЗаказКлиентаСсылка = Неопределено;
		
		Если ОшибкиЗаполнения.Количество() = 0 Тогда
			Попытка
				ЗаказКлиентаОбъект.Записать();
				ЗаказКлиентаСсылка = ЗаказКлиентаОбъект.Ссылка;
			Исключение
				ОшибкиЗаполнения.Добавить(
					ПодробноеПредставлениеОшибки(
						ИнформацияОбОшибке()));	
			КонецПопытки;
		КонецЕсли;
		
		ДобавитьСтрокуВРезультат(
			ЗаказКлиентаСсылка, 
			СтрокаРезультата, 
			ДанныеФайла.Ключ, 
			ОшибкиЗаполнения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуЗаказа(ЗаказКлиентаОбъект, ДанныеДокумента)

	ДатаДокумента = ДатаПоСтроке(ДанныеДокумента.ДатаЗаказа);
	
	ЗаказКлиентаОбъект.Дата = ДатаДокумента;
	ЗаказКлиентаОбъект.ДатаПоДаннымКлиента = ДатаДокумента;
	ЗаказКлиентаОбъект.НомерПоДаннымКлиента = ДанныеДокумента.НомерЗаказа;
	ЗаказКлиентаОбъект.ДатаОтгрузки = ДатаПоСтроке(ДанныеДокумента.ДатаДоставки);
	ЗаказКлиентаОбъект.Организация = Организация;
	ЗаказКлиентаОбъект.Контрагент = Контрагент;
	ЗаказКлиентаОбъект.Партнер = Партнер;
	ЗаказКлиентаОбъект.Грузополучатель = Контрагент;
	ЗаказКлиентаОбъект.бг_ИсточникЗаказа = Перечисления.бг_ИсточникиЗагрузкиЗаказовКлиентов.ТвойДом;
	
	бг_УчетАлкоголя.ЗаполнитьПунктНазначенияИЛицензиюВДокументе(ЗаказКлиентаОбъект);
	
	ЗаказКлиентаОбъект.Заполнить(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЗаказа(ЗаказКлиентаОбъект, ТаблицаТоваров, ОшибкиЗаполнения)
	
	ЗаказКлиентаОбъект.Товары.Очистить();
	
	НайденнаяНоменклатураКонтрагентов = НоменклатураКонтрагентовПоТаблицеФайла(ТаблицаТоваров);
	
	Отбор = Новый Структура("КодНоменклатурыКонтрагента");
	
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		НайденнаяСтрокаНоменклатуры = Неопределено;
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
		СтрокиНайденнойНоменклатуры = НайденнаяНоменклатураКонтрагентов.НайтиСтроки(Отбор);
		
		Если СтрокиНайденнойНоменклатуры.Количество() <> 0 Тогда
			НайденнаяСтрокаНоменклатуры = СтрокиНайденнойНоменклатуры[0];	
		КонецЕсли;
		
		Если НайденнаяСтрокаНоменклатуры = Неопределено 
			Или Не ЗначениеЗаполнено(НайденнаяСтрокаНоменклатуры.Номенклатура) Тогда
			
			СформироватьОшибкуПоискаНоменклатуры(ОшибкиЗаполнения, СтрокаТаблицы);
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаЗаказа = ЗаказКлиентаОбъект.Товары.Добавить();
		
		СтрокаЗаказа.НоменклатураПартнера = НайденнаяСтрокаНоменклатуры.НоменклатураПартнера;
		СтрокаЗаказа.Номенклатура = НайденнаяСтрокаНоменклатуры.Номенклатура;
		
		КоличествоТовара = Число(СтрокаТаблицы.Количество);
		
		СтрокаЗаказа.Количество = КоличествоТовара;
		СтрокаЗаказа.КоличествоУпаковок = КоличествоТовара;
		СтрокаЗаказа.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
		
		СтавкаНДС = УчетНДСУП.СтавкаНДСПоНоменклатуреИНалогообложению(
			СтрокаЗаказа.Номенклатура, 
			ЗаказКлиентаОбъект.НалогообложениеНДС, 
			ЗаказКлиентаОбъект.Организация, 
			ЗаказКлиентаОбъект.Дата);
			
		СтрокаЗаказа.СтавкаНДС = СтавкаНДС;
			
		ЧислоСтавки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтавкаНДС, "Ставка");
		
		ЦенаЗаказа = Число(СтрокаТаблицы.Цена);
		
		СтрокаЗаказа.бг_ЦенаEDI = ЦенаЗаказа;
		
		СтрокаЗаказа.Цена = ?(
			Не ЗаказКлиентаОбъект.ЦенаВключаетНДС 
				И ЗначениеЗаполнено(ЧислоСтавки), 
				ЦенаЗаказа * 100 / (100 + ЧислоСтавки), 
				ЦенаЗаказа);
		
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЗаказКлиентаОбъект);
		
		СтруктураДействий = Новый Структура;
			
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
				
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаЗаказа, СтруктураДействий, Неопределено);
						
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловияПродажи(ЗаказКлиентаОбъект)
	
	ВидНоменклатуры = ОпределитьВидНоменклатурыЗаказа(ЗаказКлиентаОбъект);
	
	ДанныеПродажи = СоглашениеИДоговорПоВидуНоменклатуры(ВидНоменклатуры);	
	ЗаполнитьЗначенияСвойств(ЗаказКлиентаОбъект, ДанныеПродажи);
	
	Если ЗначениеЗаполнено(ДанныеПродажи.Соглашение) Тогда
		ЗаказКлиентаОбъект.ЗаполнитьУсловияПродажПоСоглашению(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьВидНоменклатурыЗаказа(ЗаказКлиентаОбъект)

	ТоварыДокумента = ЗаказКлиентаОбъект.Товары.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Номенклатура.ВидНоменклатуры) КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В (&ТоварыДокумента)";
	
	Запрос.УстановитьПараметр("ТоварыДокумента", ТоварыДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.ВидНоменклатуры; 
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция СоглашениеИДоговорПоВидуНоменклатуры(ВидНоменклатуры)
	
	ДанныеПродажи = Новый Структура("Соглашение,Договор");
	
	Если ВидНоменклатуры = Неопределено Тогда
		Возврат ДанныеПродажи;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоглашенияИДоговоры.Соглашение КАК Соглашение,
	|	СоглашенияИДоговоры.Договор КАК Договор
	|ИЗ
	|	РегистрСведений.бг_СоглашенияИДоговорыСКлиентамиПоВидамНоменклатуры КАК СоглашенияИДоговоры
	|ГДЕ
	|	СоглашенияИДоговоры.Организация = &Организация
	|	И СоглашенияИДоговоры.Контрагент = &Контрагент
	|	И СоглашенияИДоговоры.ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ДанныеПродажи, Выборка);
		
	КонецЕсли;
	
	Возврат ДанныеПродажи;
	
КонецФункции

&НаКлиенте
Функция ИнициализироватьДанныеДокумента()

	Возврат Новый Структура(
				"ДатаДоставки, 
				|ДатаЗаказа, 
				|НомерЗаказа, 
				|НомерДоговора, 
				|ДатаДоговора, 
				|Товары");
	
КонецФункции

&НаКлиенте
Функция ИнициализироватьДанныеТовара()
	
	Возврат Новый Структура(
				"ЕдиницаИзмерения, 
				|Цена, 
				|Количество, 
				|Наименование, 
				|КодНоменклатурыКонтрагента, 
				|Штрихкод, 
				|НомерСтроки");
	
КонецФункции

#КонецОбласти

#Область РазборXML

&НаКлиенте
Функция ДанныеФайлов(ВыбранныеФайлы)

	СоответствиеДанныхФайлов = Новый Соответствие;
	
	Для Каждого Идентификатор Из ВыбранныеФайлы Цикл
		
		ДанныеФайла = НайденныеФайлыСписок.НайтиПоИдентификатору(Идентификатор);	
		
		ДанныеДокумента = ИнициализироватьДанныеДокумента();	
		
		ТоварыДокумента = Новый Массив;
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ДанныеФайла.Значение);
		
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
	
				ПрочитатьДанныеШапкиДокумента(ЧтениеXML, ДанныеДокумента);
				ПрочитатьДанныеДоговораДокумента(ЧтениеXML, ДанныеДокумента);
				ПрочитатьДанныеТовараДокумента(ЧтениеXML, ТоварыДокумента);	
					
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				
				Если ЧтениеXML.Имя="Document-Order" Тогда
					Прервать;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЦикла;	
		
		ЧтениеXML.Закрыть();
		
		ДанныеДокумента.Товары = ТоварыДокумента;
		
		СоответствиеДанныхФайлов.Вставить(ДанныеФайла.Значение, ДанныеДокумента);
				
	КонецЦикла;	
	
	Возврат СоответствиеДанныхФайлов;
	
КонецФункции

&НаКлиенте
Функция ТекстСодержимогоФайла(ПутьКФайлу)
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
	Пока ЧтениеXML.Прочитать() Цикл
		ЗаписьXML.ЗаписатьТекущий(ЧтениеXML);
	КонецЦикла;
	
	Возврат ЗаписьXML.Закрыть();	
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьДанныеШапкиДокумента(ЧтениеXML, ДанныеДокумента)

	Если ЧтениеXML.Имя <> "Order-Header" 
		Или ЧтениеXML.КоличествоАтрибутов() = 0 Тогда	
		Возврат;	
	КонецЕсли;
		
	Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
		
		Если ЧтениеXML.Имя = "OrderNumber" Тогда
			ДанныеДокумента.НомерЗаказа =  ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "OrderDate" Тогда
			ДанныеДокумента.ДатаЗаказа =  ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "ExpectedDeliveryDate" Тогда
			ДанныеДокумента.ДатаДоставки =  ЧтениеXML.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанныеДоговораДокумента(ЧтениеXML, ДанныеДокумента)
	
	Если ЧтениеXML.Имя <> "Contract" 
		Или ЧтениеXML.КоличествоАтрибутов() = 0 Тогда	
		Возврат;	
	КонецЕсли;
	
	Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
		
		Если ЧтениеXML.Имя = "Number" Тогда
			ДанныеДокумента.НомерДоговора =  ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "Date" Тогда
			ДанныеДокумента.ДатаДоговора =  ЧтениеXML.Значение;
		КонецЕсли;
		
	КонецЦикла;
						
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанныеТовараДокумента(ЧтениеXML, ТоварыДокумента)

	Если ЧтениеXML.Имя <> "Line-Item" 
		Или ЧтениеXML.КоличествоАтрибутов() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТовара = ИнициализироватьДанныеТовара();
	
	Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
		
		Если ЧтениеXML.Имя = "LineNumber" Тогда
			ДанныеТовара.НомерСтроки = ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "EAN" Тогда
			ДанныеТовара.Штрихкод = ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "BuyerItemCode" Тогда
			ДанныеТовара.КодНоменклатурыКонтрагента = ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "ItemDescription" Тогда
			ДанныеТовара.Наименование = ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "OrderQuantity" Тогда
			ДанныеТовара.Количество = ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "OrderNetpr" Тогда
			ДанныеТовара.Цена = ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "UnitOfMeasure" Тогда
			ДанныеТовара.ЕдиницаИзмерения = ЧтениеXML.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	ТоварыДокумента.Добавить(ДанныеТовара);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыборКаталогаЗавершение(ВыбранныйКаталог, ДополнительныеПараметры) Экспорт

	Если ВыбранныйКаталог <> Неопределено 
		И ВыбранныйКаталог.Количество() <> 0 Тогда
		
		ПутьККаталогу = ВыбранныйКаталог[0];
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиФайлыВКаталогеЗавершение(НайденныеФайлы, ДополнительныеПараметры) Экспорт

	Если НайденныеФайлы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не найдено ни одного файла'"));
		Возврат;
	КонецЕсли;
	
	Для Каждого НайденныйФайл Из НайденныеФайлы Цикл	
		НайденныеФайлыСписок.Добавить(НайденныйФайл.ПолноеИмя);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаРазделенияСодержимогоФайлов()
	
	ШаблонРазделения = 
		"
		|
		|%1
		|
		|";
	
	Возврат СтрШаблон(ШаблонРазделения, ";");
	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуВРезультат(ЗаказКлиента, СтрокаРезультата, ПутьКФайлу, ОшибкиЗаполнения)
	
	ДобавляемаяСтрока = ?(
		СтрокаРезультата = Неопределено, 
		РезультатыОбработкиФайлов.Добавить(), 
		СтрокаРезультата);
	
	ДобавляемаяСтрока.ПутьКФайлу = ПутьКФайлу;
	ДобавляемаяСтрока.ЗаказКлиента = ЗаказКлиента;
	ДобавляемаяСтрока.ОшибкиПриСоздании = СтрСоединить(ОшибкиЗаполнения, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПредставленияОшибокСозданияЗаказов(ОшибкиПоискаНоменклатуры)

	ОткрытьФорму(
		"Обработка.бг_ЗагрузкаЗаказовКлиентовСПорталаТвойДом.Форма.ФормаОшибок", 
		Новый Структура("ОшибкиПоискаСоответствийНоменклатуры", 
		ОшибкиПоискаНоменклатуры), 
		ЭтотОбъект,,,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОшибкуПоискаНоменклатуры(ОшибкиЗаполнения, СтрокаТаблицы)

	ШаблонОшибки = НСтр(
		"ru='	Для номенклатуры %1 по коду %2 не найдено соответствия в справочнике ""Номенклатура контрагентов""'");
	
	ОшибкиЗаполнения.Добавить(
		СтрШаблон(
			ШаблонОшибки, 
			СтрокаТаблицы.Наименование, 
			СтрокаТаблицы.КодНоменклатурыКонтрагента));
	
КонецПроцедуры

&НаСервере
Функция НоменклатураКонтрагентовПоТаблицеФайла(ТаблицаТоваровФайла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваровФайла.КодНоменклатурыКонтрагента КАК КодНоменклатурыКонтрагента
	|ПОМЕСТИТЬ ТаблицаТоваровФайла
	|ИЗ
	|	&ТаблицаТоваровФайла КАК ТаблицаТоваровФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Номенклатура КАК Номенклатура,
	|	НоменклатураКонтрагентов.Ссылка КАК НоменклатураПартнера,
	|	НоменклатураКонтрагентов.бг_КодНоменклатурыКонтрагента КАК КодНоменклатурыКонтрагента
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.бг_КодНоменклатурыКонтрагента В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровФайла.КодНоменклатурыКонтрагента
	|			ИЗ
	|				ТаблицаТоваровФайла КАК ТаблицаТоваровФайла)
	|	И НоменклатураКонтрагентов.Владелец = &Партнер
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКонтрагентов.Номенклатура,
	|	НоменклатураКонтрагентов.Ссылка,
	|	НоменклатураКонтрагентов.бг_КодНоменклатурыКонтрагента";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ТаблицаТоваровФайла", ТаблицаТоваровФайла);
		
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДатаПоСтроке(ДатаСтрокой)

	Возврат Дата(СтрЗаменить(ДатаСтрокой, "-", ""));	
	
КонецФункции 
	
&НаСервере
Функция ПроверитьСоответствиеНоменклатурыКонтрагентов(СоответствиеДанныхФайлам)
	
	СоответствиеОшибок = Новый Соответствие;
	
	Для Каждого ДанныеФайла Из СоответствиеДанныхФайлам Цикл
		
		ДанныеДокумента = ДанныеФайла.Значение;
		
		ТаблицаТоваров = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(ДанныеДокумента.Товары);
				
		Если ТаблицаТоваров.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru='%1 был пропущен. Отсутствуют товары в файле.'"), 
				ДанныеФайла.Ключ));
			Продолжить;	
		КонецЕсли;
		
		НайденнаяНоменклатураКонтрагентов = НоменклатураКонтрагентовПоТаблицеФайла(ТаблицаТоваров);
		
		Отбор = Новый Структура("КодНоменклатурыКонтрагента");
		
		ОшибкиЗаполнения = Новый Массив;
		
		Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
			НайденнаяСтрокаНоменклатуры = Неопределено;
			
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
			СтрокиНайденнойНоменклатуры = НайденнаяНоменклатураКонтрагентов.НайтиСтроки(Отбор);
			
			Если СтрокиНайденнойНоменклатуры.Количество() <> 0 Тогда
				НайденнаяСтрокаНоменклатуры = СтрокиНайденнойНоменклатуры[0];	
			КонецЕсли;
			
			Если НайденнаяСтрокаНоменклатуры = Неопределено 
				Или Не ЗначениеЗаполнено(НайденнаяСтрокаНоменклатуры.Номенклатура) Тогда
				
				СформироватьОшибкуПоискаНоменклатуры(ОшибкиЗаполнения, СтрокаТаблицы);
				
				Продолжить;
				
			КонецЕсли;
		
		КонецЦикла;
		
		Если ОшибкиЗаполнения.Количество() <> 0 Тогда
			СоответствиеОшибок.Вставить(ДанныеФайла.Ключ, ОшибкиЗаполнения);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СоответствиеОшибок;
	
КонецФункции

#КонецОбласти
